#include<stdio.h>
#include<Windows.h>
#include<time.h>

//********************
// 함수 선언
//********************
int init(); // 각종 변수 초기화
int total_gameboard(); // 쌓여있는 블록을 화면에 표시
int goto_xy(int x, int y); // 커서를 옮기는 함수
int show_cur_block(int shape, int angle); // 현재 사용되는 블록의 모양을 보여줌
int make_shape(); // 블록 모양의 번호(0~6번)를 랜덤으로 반환


//********************
// 변수 선언
//********************
int gameboard[21][14]; // 게임판을 구현한 배열
int blocks[7][4][4][4] = {
	// 기본 모양, 왼쪽으로 1회 회전, 2회 회전, 3회 회전

	// 막대 모양
	1,0,0,0,
	1,0,0,0,
	1,0,0,0,
	1,0,0,0,

	1,1,1,1,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,

	1,0,0,0,
	1,0,0,0,
	1,0,0,0,
	1,0,0,0,

	1,1,1,1,
	0,0,0,0,
	0,0,0,0,
	0,0,0,0,

	// 'ㅁ' 모양
	1,1,0,0,
	1,1,0,0,
	0,0,0,0,
	0,0,0,0,

	1,1,0,0,
	1,1,0,0,
	0,0,0,0,
	0,0,0,0,

	1,1,0,0,
	1,1,0,0,
	0,0,0,0,
	0,0,0,0,

	1,1,0,0,
	1,1,0,0,
	0,0,0,0,
	0,0,0,0,

	// 'ㅓ' 모양
	0,1,0,0,
	1,1,0,0,
	0,1,0,0,
	0,0,0,0,

	1,1,1,0,
	0,1,0,0,
	0,0,0,0,
	0,0,0,0,

	1,0,0,0,
	1,1,0,0,
	1,0,0,0,
	0,0,0,0,

	0,1,0,0,
	1,1,1,0,
	0,0,0,0,
	0,0,0,0,

	// 'ㄱ' 모양
	1,1,0,0,
	0,1,0,0,
	0,1,0,0,
	0,0,0,0,

	1,1,1,0,
	1,0,0,0,
	0,0,0,0,
	0,0,0,0,

	1,0,0,0,
	1,0,0,0,
	1,1,0,0,
	0,0,0,0,

	0,0,1,0,
	1,1,1,0,
	0,0,0,0,
	0,0,0,0,

	// 'ㄴ' 모양
	1,1,0,0,
	1,0,0,0,
	1,0,0,0,
	0,0,0,0,

	1,0,0,0,
	1,1,1,0,
	0,0,0,0,
	0,0,0,0,

	0,1,0,0,
	0,1,0,0,
	1,1,0,0,
	0,0,0,0,

	1,1,1,0,
	0,0,1,0,
	0,0,0,0,
	0,0,0,0,

	// 'Z' 모양
	1,1,0,0,
	0,1,1,0,
	0,0,0,0,
	0,0,0,0,

	0,1,0,0,
	1,1,0,0,
	1,0,0,0,
	0,0,0,0,

	1,1,0,0,
	0,1,1,0,
	0,0,0,0,
	0,0,0,0,

	0,1,0,0,
	1,1,0,0,
	1,0,0,0,
	0,0,0,0,

	// 'S' 모양
	0,1,1,0,
	1,1,0,0,
	0,0,0,0,
	0,0,0,0,

	1,0,0,0,
	1,1,0,0,
	0,1,0,0,
	0,0,0,0,

	0,1,1,0,
	1,1,0,0,
	0,0,0,0,
	0,0,0,0,

	1,0,0,0,
	1,1,0,0,
	0,1,0,0,
	0,0,0,0
}; // 블록 모양을 구현한 배열
int shape;


int main() {
	init();
	total_gameboard();
	shape = make_shape();
	show_cur_block(shape, 0);

	return 0;
}

int init() {
	int i, j;

	srand((unsigned)time(NULL));

	for (i = 0; i < 20; i++) {
		for (j = 0; j < 14; j++) {
			if ((j == 0) || (j == 13)) {
				gameboard[i][j] = 1;
			}
			else {
				gameboard[i][j] = 0;
			}
		}
	}

	for (j = 0; j < 14; j++) {
		gameboard[20][j] = 1;
	}

	return 0;
}

int total_gameboard() {
	for (int i = 0; i < 21; i++) {
		for (int j = 0; j < 14; j++) {
			if (gameboard[i][j] == 1)
				printf("■");
			else
				printf("  ");
		}
		printf("\n");
	}

	return 0;
}

int goto_xy(int x, int y) {
	HANDLE Handle = GetStdHandle(STD_OUTPUT_HANDLE);
	COORD pos;
	pos.Y = x;
	pos.X = y;
	SetConsoleCursorPosition(Handle, pos);

	return 0;
}

int show_cur_block(int shape, int angle) {
	for (int i = 0; i < 4; i++) {
		for (int j = 0; j < 4; j++) {
			if (blocks[shape][angle][j][i] == 1) {
				goto_xy(5 + j, 3 + i);
				printf("■");
			}
		}
	}
	goto_xy(22, 23);
	return 0;
}

int make_shape() {
	int shape;

	shape = rand() % 7;

	return shape;
}